vagabond-app/app/views/cities/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
					<h4><%= link_to post.post_title, post %>
					- <%= link_to post.user.first_name + ' ' + post.user.last_name, post.user %></h4>