vagabond-app/app/controllers/cities_controller.rb

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cities".* FROM "cities" WHERE "cities"."url_display" = $1 LIMIT $2  [["url_display", "london"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1 ORDER BY "posts"."created_at" ASC  [["city_id", 5]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 5]]
---
  def show
<<<<<<< HEAD
    @city = City.find_by_id(params[:id])
    @posts = @city.posts
    setCityId(params[:id])
=======
    @city = City.find_by(url_display: params[:city_url_display])
    if params[:page]
    	@page = params[:page]
    else
    	@page = 1
    end
    if @city.posts.count > (@page.to_i * 10) + 10