vagabond-app/app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("user_id", "city_id", "post_title", "post_content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["city_id", 2], ["post_title", "Pizza"], ["post_content", "cookies"], ["created_at", 2016-10-07 22:50:57 UTC], ["updated_at", 2016-10-07 22:50:57 UTC]]

  def edit
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @post = Post.find(params[:post_id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "user_id" = $1, "post_title" = $2, "post_content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["user_id", 2], ["post_title", "Ruby ughhhhj"], ["post_content", "jsjsjsjs"], ["updated_at", 2016-10-08 01:14:13 UTC], ["id", 2]]

  def destroy
    @post = Post.find(params[:post_id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]