vagabond-app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "current_city", "created_at", "updated_at", "first_name", "last_name", "home_city", "favorite_city") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "current_city" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_city", "NYC"], ["updated_at", 2016-10-07 00:20:47 UTC], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)