app/views/posts/show.html.erb

        <p><%= '"' + comment.comment_content + '"' %></p>
        <p><span class='italics'>- <%= comment.user.first_name %> <%= comment.user.last_name %><%= comment.created_at.strftime(" on %m/%d/%Y") %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]