app/controllers/cities_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 2]]
---
  def show
    @city = City.find_by(url_display: params[:city_url_display])
    if params[:page]
      @page = params[:page]
    else
      @page = 1
    end

    if @city.posts.count < 10
     @posts = @city.posts
    elsif @city.posts.count > (@page.to_i * 10) + 10