app/views/cities/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 2]]
---
						<% for post in @posts %>
  							<li class="city-card"><%= link_to post.post_title, '/posts/show/' + post.id.to_s %> - by <%= link_to post.user.first_name + ' ' + post.user.last_name, post.user %>